Autodesk.Revit.UI.UIApplication.OpenAndActivateDocument(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.UI.OpenOptionsForUI)
Opens and activates a Revit document.
Remarks:
This method, if successful, changes the active document.
It is not allowed to have an open transaction in the active document when calling this method.
Consequently, this method can only be used in manual transaction mode, not in automatic mode.
Additionally, this method may not be called from inside an event handler.
modelPath:
A path to a revit file to be opened.
The file can be either a Revit project, template, or family document.
openOptions: Options for opening the file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'modelPath'.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'openOptions'.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file specified by 'modelPath' cannot be found or the given 'modelPath' is not a Revit file (a project, template, or family document).
Throws Autodesk.Revit.Exceptions.ArgumentException: If the modelPath is not a Autodesk.Revit.DB.FilePath
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If the active document is currently modifiable.
If an API event handler is currently being executed.
Since:
2013